#language:ru
#noinspection NonAsciiCharacters

Функционал: Создание заведения
  Для того, чтобы создать заведение
  Как обычный пользователь
  Я должен иметь возможность зарегистрироваться и создать

  @createPlace
  Сценарий: Создать
    Допустим я нахожусь на странице "Логин"
    Если я ввожу в поля формы:
      | email | user@final.com |
      | Пароль | 123 |
    И нажимаю на кнопку формы "ВОЙТИ"
    И я должен увидеть текст "Вход выполнен"
    И я нахожусь на странице "Создания заведения"
    И я ввожу в поля формы:
      | Название    | test |
      | Описание    | test |
    И добавляю фото
    И нажимаю на галочку
    И нажимаю на кнопку формы "Добавить"
    То вижу в списке заведение

